app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "created_at", "updated_at", "post_id", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "gdsfgfdfsdf"], ["created_at", "2018-11-07 05:11:01.116636"], ["updated_at", "2018-11-07 05:11:01.116636"], ["post_id", 7], ["user_id", 1]]
---
  def create
    @comment=Comment.new
    p current_user
    @comment.user_id=current_user.id;
    @comment.post_id=params[:post_id]
    @comment.content=params[:comment]
    @comment.save

SELECT  "comments".* FROM "comments" WHERE (post_id='7') LIMIT $1  [["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE (post_id='7')
---
  def show_post_comments()
    post_id = params[:post_id];
    @comments=Comment.where("post_id=?",post_id)
    json_array = [];
    # @user=@comment.user
    # render :json =>{}

    @comments.each do |comment|