app/controllers/feed_controller.rb

  def show
    @posts = Post.includes(:user).all.order("created_at");
---
SELECT "posts".* FROM "posts" ORDER BY created_at
SELECT "users".* FROM "users" WHERE "users"."id" IN ($1, $2, $3, $4)  [["id", 14], ["id", 16], ["id", 17], ["id", 13]]