app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (6) LIMIT $1  [["LIMIT", 1]]
---
  def index
    @posts = current_user.posts.all

SELECT  "posts".* FROM "posts" WHERE "posts"."Post_id" = $1 LIMIT $2  [["Post_id", "6"], ["LIMIT", 1]]
UPDATE "posts" SET "likes" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["likes", 1], ["updated_at", "2018-11-05 08:06:04.639564"], ["id", 6]]
---
  def edit
    @post=Post.find_by(id:params[:id]);
    @post.update_attribute(:likes,@post.likes+1)

INSERT INTO "posts" ("user_id", "created_at", "updated_at", "title", "content") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 14], ["created_at", "2018-11-05 10:06:05.686603"], ["updated_at", "2018-11-05 10:06:05.686603"], ["title", "hello world"], ["content", "223333"]]
---
  def create
    @post = current_user.posts.build(post_params)

    respond_to do |format|
      if @post.save!