app/controllers/users_controller.rb

  def signup
   @users=User.all
   p @users.length
---
SELECT "users".* FROM "users"

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 12]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]

  def make_admin
     user=User.find(params[:id])
     user.admin=true
     user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
UPDATE "users" SET "admin" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["admin", true], ["updated_at", "2018-11-07 07:53:54.666238"], ["id", 18]]